<html>
<!-- Diseño y Desarrollor sitio web utilizando HTML5 / CSS3 -->
<head>
     <title>Actividad Fase 3 Diseño y Construcción II</title>
     <meta charset="utf-8"><!--codificación de caracteres utilizada (charset)--> 
     <meta name="viewport" content="width=device-width, initial-scale=1"><!--Proyecto de Sitio WEB - Año:2021 - Periodo: 16-01--><!--Etiqueta Link permite enlazar documento con la hoja de estilos CSS --><!-- <link href="css/estilos.css" rel="stylesheet" type="text/css">-->
     <link href="css/estilos.css" rel="stylesheet" type="text/css">
</head>
<body>
<center>
<table border="1" width="100%" style="border-width: 0px">
	<tr>
		<td width="163" style="border-style: none; border-width: medium">
		<p align="center">
		<img border="0" src="img/UDE.jpg" width="93" height="61"></td>
		<td style="border-style: none; border-width: medium">
		<p align="center"><font color="#000080" face="Eras Bold ITC" size="7">
		UNIVERSIDAD DEL ESTADO</font></td>
	</tr>
</table>
</center>
<article>
<p align="right"><font color="#FF0000">
<b><a href="index.html"><font color="#FF0000">RETORNAR </font></a></b></font>
</p>
<p align="justify">
<b><font face="Calibri">INTERFAZ DEL USUARIO</font></b><br><br>
La interfaz de usuario; tambi&eacute;n conocida como UI, es el espacio donde se producen las interacciones entre seres humanos y m&aacute;quinas. El objetivo de esta interacci&oacute;n es perm&iacute;tir el funcionamiento y control m&aacute;s efectivo de la m&aacute;quina desde la interacci&oacute;n con el humano.
<br><br>
Casi todos los programas tienen alguna clase de interfaz visual, que sirve al mismo tiempo para mostrar informaci&oacute;n al usuario y como un mapa de navegaci&oacute;n 
entre diferentes comandos.<br><br>
Hay interfaces visuales mucho m&aacute;s complejas e intu&iacute;tivas, como las de los tel&eacute;fonos inteligentes, que est&aacute;n dise&ntilde;adas para disminuir al m&aacute;ximo la curva de aprendizaje. Tambi&eacute;n la interfaz de los s&iacute;tios web tiende a estar dise&ntilde;ada para que cualquier visitante pueda usarla sin necesidad de conocim&iacute;entos espec&iacute;fico previos.
<br><br>
<center><img border="0" src="img/IU.jpg" width="320" height="175"></center><br>
Aunque la mayor&iacute;a de nosotros estamos acostumbrados a interfaces de tipo 
gr&aacute;ficas, existen otras formas de comunicaci&oacute;n entre un software y un usuario:
<br><br>
<b>Interfaz de voz (VUI):</b> Se trata de programas capaces de ident&iacute;ficar e interpretar el habla. El ejemplo m&aacute;s claro que tenemos es el reciente auge de las inteligencias artificiales, como Siri, que se controlan por medio de la voz. <br><br>
<b>Interfaz de texto:</b> Se utiliza principalmente en el &aacute;mbito de la programaci&oacute;n de sistemas operativos y es la evoluci&oacute;n de la interfaz de l&iacute;nea de comando primitiva que usaban los primeros programas de computadora. <br><br>
<b>Interfaz natural:</b> Se le llama as&iacute; al tipo de interfaz que identifica e interpreta acciones naturales del ser humano, como movimientos y expresiones faciales. Un ejemplo de ello son los videojuegos con interfaz kin&eacute;tica.<br><br>
<b>Interfaz cerebro-ordenador:</b> Es el tipo de interfaz m&aacute;s innovadora que ex&iacute;ste hasta el momento, y aunque a&uacute;n no cuenta con muchas aplicaciones cotidianas, se est&aacute; utilizando para controlar pr&oacute;tesis bi&oacute;nicas y dar instrucciones senc&iacute;llas a un software por medio de las ondas cerebrales.   
</article>
</body>
</html>
